#include <stdio.h>

int main(void)
{
	int i,j;
	float *x=0,*y=0,p=0;
	int h=0;
	int xxx,yyy,kkk=0;
	float arr[6][13]={{0,1,2,3,4,5,6,7,8,9,10,11,12},{2015,0.4,11.2,7.7,34.5,35.0,42.0,107.4,82.6,87.2,19.0,29.6,1.8},{2016,0.1,8.1,0,5.5,24.0,72.9,344.3,76.9,59.0,70.1,8.2,0},{2017,0.2,5.4,12.5,0,31.2,119.5,97.4,233.9,2.8,73.3,0,0},{2018,0,0,4.1,47.5,9.3,35.4,309.1,109.6,25.4,4.4,1.6,0.2},{2019,0,2.0,2.5,39.4,58.5,9.4,86.8,63.9,90.9,22.9,21.3,5.7}};
	for(i=0;i<6;i++)//打印数据列表。
	{
		for(j=0;j<13;j++)
		{
			printf("%7.1f  ",arr[i][j]);
		}
		printf("\n");
	}
	printf("====================================北京市2015年～2019年每月降水量表=====================================\n");

	
	x=&arr[1][1];
	p=*x;
	for(y=x;x<y+60;x++)//60=(6*13)-(14+4);
	{
		h++;
		if(p<*x)
		{
			p=*x;	
		}

		if(h==12 || h==2*12 || h==3*12 || h==4*12 || h==5*12)//用于跳过日期
		{
			x++;
		}
	}

	//printf("%f",p);//最大降水量求好了，还需要求这个最大降水量发生在几年几月，也就是几行几列，这很好求，因为最大降水量的值唯一，用索引遍历一下就好。
	
	for(i=0;i<6;i++)
	{
		for(j=0;j<13;j++)
		{
			if(p==arr[i][j])
			{
				xxx=i;//i也就是代表了第几年，arr[i][0]的值就是。
				yyy=j;//j代表了月，j的值就是月份。
				break;
			}
		}
	}
	printf("\n");	
	printf("第%.0f年，第%d月，有最大降水量，最大降水量为%.1fnm.",arr[xxx][0],yyy,p);

	return 0;
}
